wrk_bench/h1_async_1ms_delay.txt
Running 2m test @ http://127.0.0.1:8080/delay
  8 threads and 10000 connections
  Thread calibration: mean lat.: 108.872ms, rate sampling interval: 295ms
  Thread calibration: mean lat.: 108.450ms, rate sampling interval: 294ms
  Thread calibration: mean lat.: 108.709ms, rate sampling interval: 295ms
  Thread calibration: mean lat.: 108.120ms, rate sampling interval: 293ms
  Thread calibration: mean lat.: 108.545ms, rate sampling interval: 294ms
  Thread calibration: mean lat.: 108.953ms, rate sampling interval: 295ms
  Thread calibration: mean lat.: 108.423ms, rate sampling interval: 294ms
  Thread calibration: mean lat.: 108.588ms, rate sampling interval: 295ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   130.18ms   49.94ms 633.86ms   90.18%
    Req/Sec     7.51k   398.76     9.00k    69.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  122.69ms
 75.000%  137.73ms
 90.000%  150.91ms
 99.000%  353.54ms
 99.900%  495.36ms
 99.990%  582.14ms
 99.999%  596.48ms
100.000%  634.37ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      50.175     0.000000            1         1.00
      92.287     0.100000       623741         1.11
     101.247     0.200000      1247143         1.25
     107.967     0.300000      1870593         1.43
     114.943     0.400000      2492482         1.67
     122.687     0.500000      3115332         2.00
     126.335     0.550000      3427341         2.22
     129.471     0.600000      3737403         2.50
     132.479     0.650000      4059445         2.86
     135.039     0.700000      4368126         3.33
     137.727     0.750000      4675316         4.00
     139.135     0.775000      4824335         4.44
     140.799     0.800000      4989072         5.00
     142.463     0.825000      5138494         5.71
     144.639     0.850000      5297552         6.67
     147.199     0.875000      5446531         8.00
     148.863     0.887500      5524820         8.89
     150.911     0.900000      5604509        10.00
     153.727     0.912500      5680403        11.43
     163.455     0.925000      5756786        13.33
     198.399     0.937500      5834489        16.00
     217.983     0.943750      5873378        17.78
     236.031     0.950000      5912462        20.00
     254.975     0.956250      5951403        22.86
     271.615     0.962500      5990556        26.67
     289.791     0.968750      6029302        32.00
     297.983     0.971875      6048890        35.56
     306.943     0.975000      6068121        40.00
     316.415     0.978125      6087697        45.71
     324.351     0.981250      6106948        53.33
     335.103     0.984375      6126475        64.00
     341.247     0.985938      6136362        71.11
     346.111     0.987500      6146087        80.00
     350.719     0.989062      6155671        91.43
     355.327     0.990625      6165324       106.67
     360.703     0.992188      6175177       128.00
     364.543     0.992969      6179772       142.22
     369.151     0.993750      6184694       160.00
     373.503     0.994531      6189466       182.86
     378.111     0.995313      6194298       213.33
     384.255     0.996094      6199167       256.00
     387.583     0.996484      6201599       284.44
     392.703     0.996875      6203998       320.00
     401.919     0.997266      6206441       365.71
     416.255     0.997656      6208840       426.67
     436.735     0.998047      6211274       512.00
     450.559     0.998242      6212485       568.89
     461.055     0.998437      6213696       640.00
     470.015     0.998633      6214915       731.43
     483.839     0.998828      6216142       853.33
     496.639     0.999023      6217348      1024.00
     501.503     0.999121      6217956      1137.78
     509.695     0.999219      6218571      1280.00
     517.375     0.999316      6219162      1462.86
     523.007     0.999414      6219788      1706.67
     534.015     0.999512      6220393      2048.00
     537.599     0.999561      6220704      2275.56
     539.647     0.999609      6220995      2560.00
     546.815     0.999658      6221312      2925.71
     550.399     0.999707      6221649      3413.33
     553.471     0.999756      6221897      4096.00
     558.079     0.999780      6222055      4551.11
     561.663     0.999805      6222241      5120.00
     562.687     0.999829      6222379      5851.43
     571.903     0.999854      6222510      6826.67
     579.071     0.999878      6222665      8192.00
     581.631     0.999890      6222766      9102.22
     582.143     0.999902      6222809     10240.00
     585.215     0.999915      6222902     11702.86
     588.799     0.999927      6222981     13653.33
     589.823     0.999939      6223045     16384.00
     590.847     0.999945      6223089     18204.44
     591.359     0.999951      6223126     20480.00
     591.871     0.999957      6223167     23405.71
     592.383     0.999963      6223209     27306.67
     592.895     0.999969      6223231     32768.00
     593.919     0.999973      6223266     36408.89
     593.919     0.999976      6223266     40960.00
     594.431     0.999979      6223290     46811.43
     594.943     0.999982      6223329     54613.33
     594.943     0.999985      6223329     65536.00
     595.455     0.999986      6223342     72817.78
     595.455     0.999988      6223342     81920.00
     595.967     0.999989      6223352     93622.86
     596.479     0.999991      6223360    109226.67
     597.503     0.999992      6223376    131072.00
     597.503     0.999993      6223376    145635.56
     598.015     0.999994      6223388    163840.00
     598.015     0.999995      6223388    187245.71
     598.015     0.999995      6223388    218453.33
     598.527     0.999996      6223408    262144.00
     598.527     0.999997      6223408    291271.11
     598.527     0.999997      6223408    327680.00
     598.527     0.999997      6223408    374491.43
     598.527     0.999998      6223408    436906.67
     598.527     0.999998      6223408    524288.00
     598.527     0.999998      6223408    582542.22
     598.527     0.999998      6223408    655360.00
     598.527     0.999999      6223408    748982.86
     606.207     0.999999      6223409    873813.33
     609.791     0.999999      6223412   1048576.00
     609.791     0.999999      6223412   1165084.44
     609.791     0.999999      6223412   1310720.00
     609.791     0.999999      6223412   1497965.71
     617.471     0.999999      6223413   1747626.67
     633.855     1.000000      6223415   2097152.00
     633.855     1.000000      6223415   2330168.89
     633.855     1.000000      6223415   2621440.00
     633.855     1.000000      6223415   2995931.43
     633.855     1.000000      6223415   3495253.33
     633.855     1.000000      6223415   4194304.00
     633.855     1.000000      6223415   4660337.78
     633.855     1.000000      6223415   5242880.00
     633.855     1.000000      6223415   5991862.86
     634.367     1.000000      6223416   6990506.67
     634.367     1.000000      6223416          inf
#[Mean    =      130.185, StdDeviation   =       49.940]
#[Max     =      633.856, Total count    =      6223416]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7003220 requests in 2.00m, 13.66GB read
Requests/sec:  58360.57
Transfer/sec:    116.55MB