wrk_bench/h1_lwt.txt
Running 1m test @ http://localhost:8080
  4 threads and 1000 connections
  Thread calibration: mean lat.: 4.052ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.027ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.943ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.987ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.01ms    2.39ms  28.18ms   81.21%
    Req/Sec    15.70k     2.67k   33.36k    67.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.31ms
 75.000%    4.06ms
 90.000%    5.95ms
 99.000%   12.49ms
 99.900%   17.68ms
 99.990%   22.64ms
 99.999%   25.71ms
100.000%   28.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.037     0.000000            1         1.00
       0.827     0.100000       292968         1.11
       1.190     0.200000       585570         1.25
       1.520     0.300000       877906         1.43
       1.874     0.400000      1170335         1.67
       2.313     0.500000      1463014         2.00
       2.581     0.550000      1608955         2.22
       2.887     0.600000      1755817         2.50
       3.225     0.650000      1901847         2.86
       3.613     0.700000      2047543         3.33
       4.059     0.750000      2193843         4.00
       4.307     0.775000      2267098         4.44
       4.575     0.800000      2340278         5.00
       4.863     0.825000      2413238         5.71
       5.175     0.850000      2486363         6.67
       5.531     0.875000      2559472         8.00
       5.735     0.887500      2596326         8.89
       5.955     0.900000      2632969        10.00
       6.199     0.912500      2669200        11.43
       6.479     0.925000      2705791        13.33
       6.815     0.937500      2742379        16.00
       7.007     0.943750      2760356        17.78
       7.235     0.950000      2778635        20.00
       7.503     0.956250      2796913        22.86
       7.835     0.962500      2815251        26.67
       8.279     0.968750      2833526        32.00
       8.567     0.971875      2842745        35.56
       8.911     0.975000      2851798        40.00
       9.375     0.978125      2860891        45.71
       9.999     0.981250      2870015        53.33
      10.799     0.984375      2879206        64.00
      11.239     0.985938      2883753        71.11
      11.719     0.987500      2888333        80.00
      12.199     0.989062      2892852        91.43
      12.711     0.990625      2897436       106.67
      13.263     0.992188      2902040       128.00
      13.551     0.992969      2904306       142.22
      13.855     0.993750      2906591       160.00
      14.175     0.994531      2908850       182.86
      14.543     0.995313      2911138       213.33
      14.943     0.996094      2913444       256.00
      15.167     0.996484      2914572       284.44
      15.415     0.996875      2915723       320.00
      15.671     0.997266      2916863       365.71
      15.983     0.997656      2917986       426.67
      16.343     0.998047      2919147       512.00
      16.575     0.998242      2919699       568.89
      16.831     0.998437      2920308       640.00
      17.071     0.998633      2920879       731.43
      17.375     0.998828      2921425       853.33
      17.727     0.999023      2921993      1024.00
      17.903     0.999121      2922286      1137.78
      18.095     0.999219      2922565      1280.00
      18.335     0.999316      2922849      1462.86
      18.607     0.999414      2923138      1706.67
      18.895     0.999512      2923422      2048.00
      19.071     0.999561      2923559      2275.56
      19.263     0.999609      2923700      2560.00
      19.519     0.999658      2923843      2925.71
      19.887     0.999707      2923990      3413.33
      20.223     0.999756      2924127      4096.00
      20.447     0.999780      2924202      4551.11
      20.639     0.999805      2924271      5120.00
      20.943     0.999829      2924344      5851.43
      21.327     0.999854      2924414      6826.67
      21.855     0.999878      2924485      8192.00
      22.367     0.999890      2924519      9102.22
      22.751     0.999902      2924558     10240.00
      23.071     0.999915      2924592     11702.86
      23.279     0.999927      2924626     13653.33
      23.471     0.999939      2924663     16384.00
      23.615     0.999945      2924680     18204.44
      23.743     0.999951      2924698     20480.00
      23.887     0.999957      2924718     23405.71
      24.015     0.999963      2924734     27306.67
      24.239     0.999969      2924752     32768.00
      24.367     0.999973      2924760     36408.89
      24.447     0.999976      2924769     40960.00
      24.559     0.999979      2924779     46811.43
      24.623     0.999982      2924787     54613.33
      24.719     0.999985      2924796     65536.00
      25.407     0.999986      2924800     72817.78
      25.567     0.999988      2924805     81920.00
      25.695     0.999989      2924809     93622.86
      25.807     0.999991      2924814    109226.67
      26.079     0.999992      2924818    131072.00
      26.191     0.999993      2924820    145635.56
      26.335     0.999994      2924823    163840.00
      26.431     0.999995      2924825    187245.71
      26.495     0.999995      2924827    218453.33
      26.575     0.999996      2924829    262144.00
      26.607     0.999997      2924830    291271.11
      26.719     0.999997      2924832    327680.00
      27.487     0.999997      2924833    374491.43
      27.727     0.999998      2924834    436906.67
      27.967     0.999998      2924835    524288.00
      27.967     0.999998      2924835    582542.22
      28.063     0.999998      2924836    655360.00
      28.127     0.999999      2924839    748982.86
      28.127     0.999999      2924839    873813.33
      28.127     0.999999      2924839   1048576.00
      28.127     0.999999      2924839   1165084.44
      28.127     0.999999      2924839   1310720.00
      28.127     0.999999      2924839   1497965.71
      28.127     0.999999      2924839   1747626.67
      28.127     1.000000      2924839   2097152.00
      28.127     1.000000      2924839   2330168.89
      28.127     1.000000      2924839   2621440.00
      28.191     1.000000      2924840   2995931.43
      28.191     1.000000      2924840          inf
#[Mean    =        3.011, StdDeviation   =        2.390]
#[Max     =       28.176, Total count    =      2924840]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3536103 requests in 1.00m, 6.90GB read
Requests/sec:  58935.10
Transfer/sec:    117.69MB